Ran Plan for project: `aws` dir: `aws` workspace: `filecoin-glif-mainnet-apn1`

<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/tls from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Using previously-installed hashicorp/random v3.4.3
- Using previously-installed hashicorp/kubernetes v2.13.1
- Using previously-installed hashicorp/helm v2.6.0
- Using previously-installed hashicorp/tls v4.0.2
- Using previously-installed hashicorp/local v2.2.3
- Using previously-installed hashicorp/aws v4.33.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "filecoin-glif-mainnet-apn1".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.codebuild_multirepository_cd_hyperspace[0].aws_codebuild_project.codebuild will be updated in-place
~ resource "aws_codebuild_project" "codebuild" {
        id                     = "arn:aws:codebuild:ap-northeast-1:499623857295:project/filecoin-mainnet-apn1-glif-hyperspace-codebuild-deploy"
        name                   = "filecoin-mainnet-apn1-glif-hyperspace-codebuild-deploy"
        tags                   = {
            "Environment"     = "mainnet"
            "Project"         = "Filecoin"
            "ProvisionedWith" = "Terraform"
            "Sub_environment" = "glif"
        }
        # (12 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = <<-EOT
                # Do not change version. This is the version of aws buildspec, not the version of your buildspec file.
                version: 0.2
                
                env:
                  variables:
                    IMAGE_NAME: 'hyperspace'
                    IMAGE_NETWORK: 'hyperspacenet'
              -     CUSTOM_TAG: 'v1.20.0-hyperspace-nv21-hotfix-01'
              +     CUSTOM_TAG: 'v1.20.0-hyperspace-0201'
                    PROJECT: 'filecoin'
                    ENVIRONMENT: 'mainnet'
                    SUB_ENV: 'glif'
                    SHORT_REGION: 'apn1'
                    AWS_ACCOUNT_ID: '499623857295'
                    DOCKERUHUB_ORGANIZATION: 'glif'
                    KUBECTL_VERSION: 1.24.7
                  secrets-manager:
                    DOCKERHUB_USERNAME: "filecoin-mainnet-apn1-glif-dockerhub-glifio:username"
                    DOCKERHUB_PASS: "filecoin-mainnet-apn1-glif-dockerhub-glifio:password"
                    AWS_ACCESS_KEY_ID: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_ACCESS_KEY_ID"
                    AWS_SECRET_ACCESS_KEY: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_SECRET_ACCESS_KEY"
                
                phases:
                  install:
                    commands:
                      - echo Environment Variables
                      - printenv
                      - curl -o kubectl https://s3.us-west-2.amazonaws.com/amazon-eks/${KUBECTL_VERSION}/2022-10-31/bin/linux/arm64/kubectl
                      - chmod +x ./kubectl
                      - mv kubectl /usr/bin/
                      - aws eks --region $AWS_REGION update-kubeconfig --name $PROJECT-$ENVIRONMENT-$SHORT_REGION-$SUB_ENV-eks
                
                  pre_build:
                    commands:
                      - echo Build STARTED
                      - docker login --username $DOCKERHUB_USERNAME --password $DOCKERHUB_PASS
                
                  build:
                    commands:
                      - echo Image built
                      - cd ../../glifio/filecoin-docker/
                      - docker build --network host --build-arg NETWORK=$IMAGE_NETWORK --build-arg BRANCH=$CUSTOM_TAG -t $IMAGE_NAME:latest -f Dockerfile_arm .
                      - docker tag $IMAGE_NAME:latest $DOCKERUHUB_ORGANIZATION/lotus:hyperspace-arm
                      - docker push $DOCKERUHUB_ORGANIZATION/lotus:hyperspace-arm
                      - kubectl -n network scale --replicas 0 statefulset hyperspace-lotus
                      - kubectl -n network wait --timeout=1m --for=delete pod/hyperspace-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset hyperspace-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/hyperspace-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset hyperspace-slave-0-lotus
                      - kubectl -n network wait --timeout=1m --for=delete pod/hyperspace-slave-0-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset hyperspace-slave-0-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/hyperspace-slave-0-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset hyperspace-slave-1-lotus
                      - kubectl -n network wait --timeout=1m --for=delete pod/hyperspace-slave-1-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset hyperspace-slave-1-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/hyperspace-slave-1-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset hyperspace-private-0-lotus
                      - kubectl -n network wait --timeout=1m --for=delete pod/hyperspace-private-0-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset hyperspace-private-0-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/hyperspace-private-0-lotus-0
            EOT
            # (5 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_codebuild_project.codebuild will be created
+ resource "aws_codebuild_project" "codebuild" {
      + arn                    = (known after apply)
      + badge_enabled          = true
      + badge_url              = (known after apply)
      + build_timeout          = 40
      + concurrent_build_limit = 10
      + description            = "CI/CD pipeline for a filecoin wallaby application-deploy"
      + encryption_key         = (known after apply)
      + id                     = (known after apply)
      + name                   = "filecoin-mainnet-apn1-glif-wallaby-codebuild-deploy"
      + project_visibility     = "PRIVATE"
      + public_project_alias   = (known after apply)
      + queued_timeout         = 480
      + service_role           = (known after apply)
      + source_version         = "f8-wallaby-latest"
      + tags                   = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
      + tags_all               = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_LARGE"
          + image                       = "aws/codebuild/amazonlinux2-aarch64-standard:2.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = true
          + type                        = "ARM_CONTAINER"

          + environment_variable {
              + name  = "AWS_ACCOUNT_ID"
              + type  = "PLAINTEXT"
              + value = "499623857295"
            }
          + environment_variable {
              + name  = "ENVIRONMENT"
              + type  = "PLAINTEXT"
              + value = "mainnet"
            }
          + environment_variable {
              + name  = "IS_BUILD_ONLY"
              + type  = "PLAINTEXT"
              + value = "0"
            }
          + environment_variable {
              + name  = "PROJECT"
              + type  = "PLAINTEXT"
              + value = "filecoin"
            }
          + environment_variable {
              + name  = "REGION"
              + type  = "PLAINTEXT"
              + value = "ap-northeast-1"
            }
          + environment_variable {
              + name  = "REGION_SHORT"
              + type  = "PLAINTEXT"
              + value = "apn1"
            }
          + environment_variable {
              + name  = "SUB_ENVIRONMENT"
              + type  = "PLAINTEXT"
              + value = "glif"
            }
        }

      + secondary_source_version {
          + source_identifier = "SECOND"
          + source_version    = "build_file_for_wallaby"
        }

      + secondary_sources {
          + git_clone_depth   = 1
          + location          = "https://github.com/glifio/filecoin-docker.git"
          + source_identifier = "SECOND"
          + type              = "GITHUB"
        }

      + source {
          + buildspec       = <<-EOT
                # Do not change version. This is the version of aws buildspec, not the version of your buildspec file.
                version: 0.2
                
                env:
                  variables:
                    IMAGE_NAME: 'wallaby'
                    IMAGE_NETWORK: 'wallabynet'
                    CUSTOM_WALLABY_TAG: 'f8-wallaby-latest'
                    PROJECT: 'filecoin'
                    ENVIRONMENT: 'mainnet'
                    SUB_ENV: 'glif'
                    SHORT_REGION: 'apn1'
                    AWS_ACCOUNT_ID: '499623857295'
                    DOCKERUHUB_ORGANIZATION: 'glif'
                    KUBECTL_VERSION: 1.24.7
                  secrets-manager:
                    DOCKERHUB_USERNAME: "filecoin-mainnet-apn1-glif-dockerhub-glifio:username"
                    DOCKERHUB_PASS: "filecoin-mainnet-apn1-glif-dockerhub-glifio:password"
                    AWS_ACCESS_KEY_ID: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_ACCESS_KEY_ID"
                    AWS_SECRET_ACCESS_KEY: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_SECRET_ACCESS_KEY"
                
                phases:
                  install:
                    commands:
                      - echo Environment Variables
                      - printenv
                      - curl -o kubectl https://s3.us-west-2.amazonaws.com/amazon-eks/${KUBECTL_VERSION}/2022-10-31/bin/linux/arm64/kubectl
                      - chmod +x ./kubectl
                      - mv kubectl /usr/bin/
                      - aws eks --region $AWS_REGION update-kubeconfig --name $PROJECT-$ENVIRONMENT-$SHORT_REGION-$SUB_ENV-eks
                
                  pre_build:
                    commands:
                      - echo Build STARTED
                      - docker login --username $DOCKERHUB_USERNAME --password $DOCKERHUB_PASS
                  build:
                    commands:
                      - echo Image built
                      - cd ../../glifio/filecoin-docker/
                      - docker build --network host --build-arg NETWORK=$IMAGE_NETWORK --build-arg BRANCH=$CUSTOM_WALLABY_TAG -t $IMAGE_NAME:latest -f Dockerfile_arm .
                      - docker tag $IMAGE_NAME:latest $DOCKERUHUB_ORGANIZATION/lotus:wallaby_latest_arm
                      - docker push $DOCKERUHUB_ORGANIZATION/lotus:wallaby_latest_arm
                      - kubectl -n network scale --replicas 0 statefulset wallaby-archive-lotus
                      - kubectl -n network delete pvc vol-lotus-wallaby-archive-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset wallaby-archive-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/wallaby-archive-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset wallaby-archive-slave-lotus
                      - kubectl -n network delete pvc vol-lotus-wallaby-archive-slave-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset wallaby-archive-slave-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/wallaby-archive-slave-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset wallaby-archive-slave-1-lotus
                      - kubectl -n network delete pvc vol-lotus-wallaby-archive-slave-1-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset wallaby-archive-slave-1-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/wallaby-archive-slave-1-lotus-0
                      - kubectl -n network scale --replicas 0 statefulset wallaby-archive-private-0-lotus
                      - kubectl -n network delete pvc vol-lotus-wallaby-archive-private-0-lotus-0
                      - kubectl -n network scale --replicas 1 statefulset wallaby-archive-private-0-lotus
                      - kubectl -n network wait --timeout=10m --for=condition=ready pod/wallaby-archive-private-0-lotus-0
            EOT
          + git_clone_depth = 1
          + location        = "https://github.com/protofire/wallaby.git"
          + type            = "GITHUB"
        }
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_codebuild_source_credential.token will be created
+ resource "aws_codebuild_source_credential" "token" {
      + arn         = (known after apply)
      + auth_type   = "PERSONAL_ACCESS_TOKEN"
      + id          = (known after apply)
      + server_type = "GITHUB"
      + token       = (sensitive value)
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_codebuild_webhook.webhook_codebuild_build[0] will be created
+ resource "aws_codebuild_webhook" "webhook_codebuild_build" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "filecoin-mainnet-apn1-glif-wallaby-codebuild-deploy"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "PULL_REQUEST_CREATED, PULL_REQUEST_UPDATED"
              + type                    = "EVENT"
            }
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "^refs/tags/f8-wallaby-latest"
              + type                    = "BASE_REF"
            }
        }
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_codebuild_webhook.webhook_codebuild_deploy[0] will be created
+ resource "aws_codebuild_webhook" "webhook_codebuild_deploy" {
      + build_type   = "BUILD"
      + id           = (known after apply)
      + payload_url  = (known after apply)
      + project_name = "filecoin-mainnet-apn1-glif-wallaby-codebuild-deploy"
      + secret       = (sensitive value)
      + url          = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "PUSH"
              + type                    = "EVENT"
            }
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "^refs/tags/f8-wallaby-latest"
              + type                    = "HEAD_REF"
            }
        }
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_iam_policy.codebuild_policy will be created
+ resource "aws_iam_policy" "codebuild_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:*",
                          + "ssm:*",
                          + "logs:*",
                          + "kms:*",
                          + "codeartifact:GetAuthorizationToken",
                          + "codeartifact:GetRepositoryEndpoint",
                          + "codeartifact:ReadFromRepository",
                          + "sts:GetServiceBearerToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
      + tags_all  = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_iam_role.codebuild_role will be created
+ resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
      + tags_all              = {
          + "Environment"     = "mainnet"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_iam_role_policy_attachment.codebuild_role-ecr-policy-attachment will be created
+ resource "aws_iam_role_policy_attachment" "codebuild_role-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess"
      + role       = (known after apply)
    }

  # module.codebuild_multirepository_cd_wallaby[0].aws_iam_role_policy_attachment.codebuild_role-policy-attachment will be created
+ resource "aws_iam_role_policy_attachment" "codebuild_role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.codebuild_multirepository_cd_wallaby[0].random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.codebuild_multirepository_cd_wallaby[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 10 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=glifio%252Ffilecoin-iac%252Faws%252Ffilecoin-glif-mainnet-apn1)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p aws`
</details>
Plan: 10 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
